Autodesk.DesignScript.Geometry.Curve.Reverse
Reverse the direction of the curve

Autodesk.DesignScript.Geometry.Curve.DivideByLength(System.Int32)
Divides curve into given number of equal length curves