Autodesk.DesignScript.Geometry.PolySurface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Makes PolySurface by Loft through PolyCurves.

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.PolyCurve)
Make Polysurface by sweeping Polycurve along rail.

Autodesk.DesignScript.Geometry.PolySurface.ProjectCurve(Autodesk.DesignScript.Geometry.Curve)
Project curve on polysurface