Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Create a Solid by lofting between input cross section closed PolyCurves.

Autodesk.DesignScript.Geometry.Solid.BySweep(Autodesk.DesignScript.Geometry.PolyCurve,Autodesk.DesignScript.Geometry.PolyCurve,System.Boolean)
Makes PolySurface by Sweep through Polycurves.

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Makes PolySurface by Loft through Polycurves.

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Union a collection of solids into one solid

Autodesk.DesignScript.Geometry.Solid.Centroid
The centroid of the solid

Autodesk.DesignScript.Geometry.Solid.Union(Autodesk.DesignScript.Geometry.Solid)
The boolean union of this solid and another.

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
The boolean difference of this solid with another

Autodesk.DesignScript.Geometry.Solid.Volume
The total volume of the solid