Autodesk.DesignScript.Geometry.CoordinateSystem.Identity


Autodesk.DesignScript.Geometry.CoordinateSystem.ByMatrix(System.Double[])


Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(System.Double,System.Double)


Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(System.Double,System.Double,System.Double)


Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)


Autodesk.DesignScript.Geometry.CoordinateSystem.ByPlane(Autodesk.DesignScript.Geometry.Plane)


Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)


Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)


Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)


Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)


Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse


Autodesk.DesignScript.Geometry.CoordinateSystem.Mirror(Autodesk.DesignScript.Geometry.Plane)


Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)


Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)


Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)


Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular


Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho


Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho


Autodesk.DesignScript.Geometry.CoordinateSystem.Determinant


Autodesk.DesignScript.Geometry.CoordinateSystem.Origin


Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis


Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis


Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis


Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor


Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor


Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor


Autodesk.DesignScript.Geometry.CoordinateSystem.XYPlane


Autodesk.DesignScript.Geometry.CoordinateSystem.YZPlane


Autodesk.DesignScript.Geometry.CoordinateSystem.ZXPlane
