Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Construct a Solid Cylinder defined by a parent CoordinateSystem, the radius, and the height of the cylinder
coordinateSystem: The parent CoordinateSystem of the Cylinder.  The bottom circular Face of the Cylinder is at the Origin of the CoordinateSystem.
radius: The radius of the cylinder
height: The height of the cylinder
Returns:

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Construct a Solid Cylinder given the bottom and top center point of the Cylinder.
startPoint: The center of the bottom circular face of the Cylinder
endPoint: The center of the top circular face of the Cylinder
radius: The radius of the Cylinder
Returns:

Autodesk.DesignScript.Geometry.Cylinder.Radius


Autodesk.DesignScript.Geometry.Cylinder.Height
